backend/controllers/BoxController.php

    public function actionCreate($id)
    {
        $model = new Box();
        $model->store_id = $id;
        $model->number = (Box::find()->where(['store_id'=> $id])->count())+1;
        $model->prefix = $model->store->prefix;

        if ($model->load(Yii::$app->request->post()))
---
SELECT COUNT(*) FROM `box` WHERE `store_id`='1'
SELECT * FROM `store` WHERE `id`='1'