backend/controllers/ItemController.php

SELECT * FROM `box` WHERE `id`='8'
---
    public function actionUpdate($id)
    {
        $model = Item::findOne($id);
        $product_model = new Product();
        $model->box_id = $id;
        $model->store_id = $model->box->store_id;

        $dataProvider = new ActiveDataProvider([
            'query'=> Item::find()
            ->where(['status'=> [Item::STATUS_AVAILABLE, Item::STATUS_LOCKED],'store_id'=> ($model->box->store_id)]),
        ]);

        if ($model->load(Yii::$app->request->post()))