backend/controllers/ItemController.php

    public function actionCreate($id)
    {
        // 创建 新 Item 数据
        $model = new Item();
        $model->box_id = $id;   // 保存 $id为 Box Id
        $model->store_id = $model->box->store_id; // Item Model里， 运行 Box数据表查询 及 获取当中的 store_id

        // 获取传送的数据 (点击 Save 按钮)
        if ($model->load(Yii::$app->request->post()))
        {
            // 如果没有输入价格
            //print_r($model->sku);
            $getsku = Product::find()->where(['sku' => $model->sku])->one();
---
SELECT * FROM `product` WHERE `sku`='KS001MAS'

    public function actionUpdate($id)
    {
        // 使用 $id 搜索当前Item数据
        $model = $this->findModel($id);

        // 获取传送的数据 (点击 Save 按钮)
        if ($model->load(Yii::$app->request->post()))
        {
            // 如果没有输入价格
            if ($model->price <= 0)
            {
                // Item价格 默认为相关Product的价格
                $model->price = $model->product->price;
            }
            // 保存 数据 进入Item表单里
            if($model->save())
            {
                // 返回 store/view页面 当保存成功
                return $this->redirect([
                    'store/view',
                    'id' => $model->store_id
                ]);
            }
        }

        // 查询当前店 所有未成功卖出的产品
        $dataProvider = new ActiveDataProvider([
            'query'=> Item::find()->where([
                'status'=> [Item::STATUS_AVAILABLE, Item::STATUS_LOCKED],
                'store_id'=> ($model->box->store_id)
            ]),
        ]);
---
SELECT * FROM `box` WHERE `id`=8