backend/controllers/StoreController.php

    protected function findModel($id)
    {
        if (($model = Store::findOne($id)) !== null) {
---
SELECT * FROM `store` WHERE `id`='2'