backend/controllers/StoreController.php

SELECT * FROM `store` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Store::findOne($id)) !== null) {