common/models/Box.php

    public function getStatusText()
    {
        if($this->status)
        {
            // 如果 Box盒子 包含 Item产品
            if($this->item)
            {
                $text = "Available"; // 盒子包含产品
                $this->status = self::BOX_STATUS_NOT_AVAILABLE;
                $this->save();
            }
            // 相反：如果 Box盒子 没有包含 Item产品
            else
            {
                $text = "Not Available"; // 盒子为空
                $this->status = self::BOX_STATUS_AVAILABLE;
                $this->save();
---
UPDATE `box` SET `status`=1, `updated_at`=1567661106 WHERE `id`=8
UPDATE `box` SET `status`=2, `updated_at`=1567661096 WHERE `id`=8