common/models/Box.php

SELECT * FROM `item` WHERE (`item`.`status` IN (0, 9)) AND (`box_id`=1)
---
    public function getItem()
    {
        return $this->hasOne(Item::className(), ['box_id'=>'id'])
        ->orderBy(['id' => SORT_DESC])
        ->where(['status' => [Item::STATUS_AVAILABLE, Item::STATUS_LOCKED]])
        ->limit(1);