backend/views/item/_form_create.php

SELECT `sku` AS `value`, `name` AS `label`, `id` FROM `product`
---



    <?php    $str = Product::find()
        ->select(['sku as value', 'CONCAT_WS(" - ",name,sku) as  label' ,'id as id'])
        ->asArray()
        ->all(); ?>